Agora-Build/HapticHatch/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash size — ESP32-S3 module with 8 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# PSRAM — 8 MB OPI PSRAM (AP_3v3, embedded on the chip)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Partition table — 3 MB app partition to fit the Agora RTSA SDK
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Forward declaration — defined in components/sensor/Kconfig (Task 2)
CONFIG_SENSOR_SAMPLE_RATE_HZ=100

# Defined in main/Kconfig.projbuild
CONFIG_HAPTIC_QUEUE_DEPTH=4

# Forward declaration — defined in components/rtsa_transport/Kconfig (Task 4)
CONFIG_RTSA_CHANNEL_ID=""

CONFIG_AGORA_APP_ID="YOUR APP ID"
CONFIG_AGORA_SIGNALING_LOCAL_UID="device_b"
CONFIG_AGORA_SIGNALING_REMOTE_UID="device_a"
CONFIG_AGORA_SIGNALING_TOKEN="YOUR ACCESS TOKEN"
CONFIG_DEMO_WIFI_SSID="AGORA_AI_KIT"
CONFIG_DEMO_WIFI_PASSWORD="*"
